example/example.org
#+title: The Dark \LaTeX
#+subtitle: An Example of the Emacs Org Dnd Mode
#+author: The Emacs Org Dnd team
#+latex_class: dndbook
#+latex_header: \usepackage{lipsum}
#+options: bg:full justified:nil toc:2 title:t date:nil
* Layouts
** Templates
   This package provides three different templates. They differ in the underlying \LaTeX{} classes that they use and in the way that they map the different Org headers to \LaTeX{} headers.
*** dndbook
    This is the most complete one. It will use the =dndbook= \LaTeX{} class and it will map the headers starting at =part= and going down from there.
*** dndbookbrief
    This is an alternative version of the above. It also uses the =dndbook= class, but the first level of headers is mapped to =chapter=. This makes the output more compact as parts uses full pages.
*** dndarticle
    This is the best style for short documents and it uses the =dndarticle= class. Top level headers are mapped to =sections=, therefore, there are less levels available than in the others.
** Sections
 \DndDropCapLine{T}{his package is designed to aid you in} writing beautifully typeset documents for the fifth edition of the world's greatest roleplaying game. It starts by adjusting the section formatting from the defaults in \LaTeX{} to something a bit more familiar to the reader. The article formatting is displayed above.
*** Section

    Sections break up chapters into large groups of associated text. Sections are defined by using Org headings. Depending on the template selected, the headings will be mapped to different latex section types. See the =org-latex-classes= variable to see how the mappings are done for the different templates.
**** Subsection
     Subsections further break down the information for the reader.
***** Subsubsection
      Subsubsections are the furthest division of text that still have a block header. Below this level, headers are displayed
      inline.
****** Paragraph.
       The paragraph format is seldom used in the core books, but is available if you prefer it to the “normal” style.
******* Subparagraph
        The subparagraph format with the paragraph indent is likely going to be more familiar to the reader.
***** Hanging indent feature
      The description list allows hanging indented lists of options, such as those used for class features, background
      skill/tool proficiency options, and sometimes area features, for example:
      - Doors: :: The doors are made from thick lumber and are unlocked.
      - Light: :: The area is illuminated by candles placed in sconces on the walls. Each candle has had a continual flame spell cast on it. Dispelling a flame is rumoured to give grievous offence to the host.
      - Ventilation: :: All areas contain an adequate air supply. The air is renewed via lung-like sacks that cling to the ceiling.
*** Special Sections
    The module also includes functions to aid in the proper typesetting of multi-line section headers: =\DndFeatHeader= for feats, =\DndItemHeader= magic items and traps, and =\DndSpellHeader= for spells.

 #+begin_feat
 Typesetting Savant
 Prerequisite: a distribution

 You have acquired a package which aids in typesetting source material for one of your favorite games, giving you the
 following benefits:
 - You have advantage on Intelligence checks to typeset new content.
 - When you fail an Intelligence check to typeset new content, you can ask questions online at the package’s website.

 Some other important features:

 - Doors :: The doors are made from thick lumber and are unlocked.
 - Light :: The area is illuminated by candles placed in sconces on the walls. Each candle has had a continual flame spell cast on it. Dispelling a flame is rumoured to give grievous offence to the host.
 - Ventilation :: All areas contain an adequate air supply. The air is renewed via lung-like sacks that cling to the ceiling.
 #+end_feat

 #+BEGIN_item
 Foo’s Quill
 Wondrous item, rare

 This quill has 3 charges. While holding it, you can use an action to expend 1 of its charges. The quill leaps from your
 hand and writes a contract applicable to your situation.

 The quill regains 1d3 expended charges daily at dawn.
 #+END_item

 #+NAME: Beautiful Typesetting
 #+ATTR_SPELL: :level 4 :school illusion :range 5 feet :cast 1 action :duration Until dispelled :comp S, M (ink and parchment, which the spell consumes)
 #+BEGIN_SPELL
 You are able to transform a written message of any length into a beautiful
 scroll. All creatures within range that can see the scroll must make a wisdom
 saving throw or be charmed by you until the spell ends.

 While the creature is charmed by you, they cannot take their eyes off the
 scroll and cannot willingly move away from the scroll. Also, the targets can
 make a wisdom saving throw at the end of each of their turns. On a success,
 they are no longer charmed.
 #+END_SPELL

 #+begin_quotes
 "Sometimes, what you need, what you want
 and what you have at this time turn out to be the same thing: An uplifting quote."
 The adventurer
 #+end_quotes

*** Map Regions                                                            :map:

 The map region commands provides automatic numbering of areas. You just need to add the /map/ tag to your headings and they will be considered part of a map. Notice that only headings equivalent to certain levels in the hierarchy (=subsection= and =subsubsection= when translated to \LaTeX) will be tagged in this way.

**** Village of Hommlet

 This is the village of hommlet.

***** Inn of the Welcome Wench

 Inside the village is the inn of the Welcome Wench.

***** Blacksmith's Forge

 There's a blacksmith in town, too.

**** Foo's Castle

 This is foo's home, a hovel of mud and sticks.

***** Moat

 This ditch has a board spanning it.

***** Entrance

 A five-foot hole reveals the dirt floor illuminated by a hole in the roof.

*** Alternative Map Region Styles
    Published modules sometimes use plain numbers for locations, sometimes plain letters, and sometimes they prefix a
character to the front of the numbers. The following options can be used to display in these forms. Notice that only the
second heading has number/letters vs the two levels from the standard style:

**** Numbered Dungeon                                              :numberedmap:
Areas in the Numbered Dungeon have sequential numbers. This is done using
the /numberedmap/ tag in your headers:

***** Entry
The entry.
***** Trap
The trap.
***** Fight
The fight.
***** Exit
The exit.
**** Lettered Dungeon                                              :letteredmap:
Same as above but using the /letteredmap/ tag in the headers:

***** Entry
The entry.
***** Trap
The trap.
***** Fight
The fight.
***** Exit
The exit.
