example/example.tex
% Created 2024-06-07 Fri 00:06
% Intended LaTeX compiler: lualatex
\documentclass[10pt,twoside,twocolumn,openany,bg=full,notitlepage,nodeprecatedcode]{dndbook}
\usepackage[american]{babel}
\usepackage[utf8]{inputenc}
\usepackage[hidelinks]{hyperref}
\usepackage{stfloats}
\usetikzlibrary{intersections}
\usepackage[singlelinecheck=false]{caption}
\captionsetup[table]{labelformat=empty,font={sf,sc,bf,},skip=0pt}
\newcolumntype{H}{>{\setbox0=\hbox\bgroup}c<{\egroup}@{}}\usepackage{titling}
\pretitle{\begin{center}\Huge
\scshape \fontfamily{pbk}\fontsize{50}{40}\selectfont}
\posttitle{\par\end{center}}


\usepackage{booktabs}
\usepackage{lipsum}
\author{The Emacs Org Dnd team}
\date{}
\title{The Dark \LaTeX\\\medskip
\large An Example of the Emacs Org Dnd Mode}
\hypersetup{
 pdfauthor={The Emacs Org Dnd team},
 pdftitle={The Dark \LaTeX},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
{\let\clearpage\relax \tableofcontents}

\part{Layouts}
\label{sec:org26478f4}
\chapter{Templates}
\label{sec:org6a400db}
This package provides three different templates. They differ in the underlying \LaTeX{} classes that they use and in the way that they map the different Org headers to \LaTeX{} headers.
\section{dndbook}
\label{sec:orgd7de797}
This is the most complete one. It will use the \texttt{dndbook} \LaTeX{} class and it will map the headers starting at \texttt{part} and going down from there.
\section{dndbookbrief}
\label{sec:org1f8f396}
This is an alternative version of the above. It also uses the \texttt{dndbook} class, but the first level of headers is mapped to \texttt{chapter}. This makes the output more compact as parts uses full pages.
\section{dndarticle}
\label{sec:orgbb29c25}
This is the best style for short documents and it uses the \texttt{dndarticle} class. Top level headers are mapped to \texttt{sections}, therefore, there are less levels available than in the others.
\chapter{Sections}
\label{sec:org97ad316}
\DndDropCapLine{T}{his package is designed to aid you in} writing beautifully typeset documents for the fifth edition of the world's greatest roleplaying game. It starts by adjusting the section formatting from the defaults in \LaTeX{} to something a bit more familiar to the reader. The article formatting is displayed above.
\section{Section}
\label{sec:org3d5288a}

Sections break up chapters into large groups of associated text. Sections are defined by using Org headings. Depending on the template selected, the headings will be mapped to different latex section types. See the \texttt{org-latex-classes} variable to see how the mappings are done for the different templates.
\subsection{Subsection}
\label{sec:org37e8b71}
Subsections further break down the information for the reader.
\subsubsection{Subsubsection}
\label{sec:org60fe0a1}
Subsubsections are the furthest division of text that still have a block header. Below this level, headers are displayed
inline.
\paragraph{Paragraph.}
\label{sec:org19539be}
The paragraph format is seldom used in the core books, but is available if you prefer it to the “normal” style.
\begin{enumerate}
\item Subparagraph
\label{sec:org1b77f08}
The subparagraph format with the paragraph indent is likely going to be more familiar to the reader.
\end{enumerate}
\subsubsection{Hanging indent feature}
\label{sec:org4aa007a}
The description list allows hanging indented lists of options, such as those used for class features, background
skill/tool proficiency options, and sometimes area features, for example:
\begin{description}
\item[{Doors:}] The doors are made from thick lumber and are unlocked.
\item[{Light:}] The area is illuminated by candles placed in sconces on the walls. Each candle has had a continual flame spell cast on it. Dispelling a flame is rumoured to give grievous offence to the host.
\item[{Ventilation:}] All areas contain an adequate air supply. The air is renewed via lung-like sacks that cling to the ceiling.
\end{description}
\section{Special Sections}
\label{sec:org0f68d06}
The module also includes functions to aid in the proper typesetting of multi-line section headers: \texttt{\textbackslash{}DndFeatHeader} for feats, \texttt{\textbackslash{}DndItemHeader} magic items and traps, and \texttt{\textbackslash{}DndSpellHeader} for spells.

\DndFeatHeader{Typesetting Savant}[Prerequisite: a distribution]
{You have acquired a package which aids in typesetting source material for one of your favorite games, giving you the
following benefits:
\begin{itemize}
\item You have advantage on Intelligence checks to typeset new content.
\item When you fail an Intelligence check to typeset new content, you can ask questions online at the package’s website.
\end{itemize}
Some other important features:
\begin{description}[nosep, after = { \vspace{4pt plus 1pt minus 1pt} }]
\item[Doors:] The doors are made from thick lumber and are unlocked.
\item[Light:] The area is illuminated by candles placed in sconces on the walls. Each candle has had a continual flame spell cast on it. Dispelling a flame is rumoured to give grievous offence to the host.
\item[Ventilation:] All areas contain an adequate air supply. The air is renewed via lung-like sacks that cling to the ceiling.
\end{description}}

\DndItemHeader{Foo’s Quill}{Wondrous item, rare}
This quill has 3 charges. While holding it, you can use an action to expend 1 of its charges. The quill leaps from your
hand and writes a contract applicable to your situation.
The quill regains \DndDice{1d3} expended charges daily at dawn.

\DndSpellHeader%
{Beautiful Typesetting}
{4th-level illusion}
{1 action}
{5 feet}
{S, M (ink and parchment, which the spell consumes)}
{Until dispelled}
You are able to transform a written message of any length into a beautiful
scroll. All creatures within range that can see the scroll must make a wisdom
saving throw or be charmed by you until the spell ends.

While the creature is charmed by you, they cannot take their eyes off the
scroll and cannot willingly move away from the scroll. Also, the targets can
make a wisdom saving throw at the end of each of their turns. On a success,
they are no longer charmed.

\DndQuote{"Sometimes, what you need, what you want}
{and what you have at this time turn out to be the same thing: An uplifting quote."}
{The adventurer}

\section{Map Regions}
\label{sec:orga32af69}

The map region commands provides automatic numbering of areas. You just need to add the \emph{map} tag to your headings and they will be considered part of a map. Notice that only headings equivalent to certain levels in the hierarchy (\texttt{subsection} and \texttt{subsubsection} when translated to \LaTeX) will be tagged in this way.

\DndArea{Village of Hommlet}
\label{sec:org4f1a55d}

This is the village of hommlet.

\DndSubArea{Inn of the Welcome Wench}
\label{sec:org4e01daa}

Inside the village is the inn of the Welcome Wench.

\DndSubArea{Blacksmith's Forge}
\label{sec:org111cbb2}

There's a blacksmith in town, too.

\DndArea{Foo's Castle}
\label{sec:org3ef71aa}

This is foo's home, a hovel of mud and sticks.

\DndSubArea{Moat}
\label{sec:org3923bcd}

This ditch has a board spanning it.

\DndSubArea{Entrance}
\label{sec:orgdcbea78}

A five-foot hole reveals the dirt floor illuminated by a hole in the roof.

\section{Alternative Map Region Styles}
\label{sec:org66eabc0}
    Published modules sometimes use plain numbers for locations, sometimes plain letters, and sometimes they prefix a
character to the front of the numbers. The following options can be used to display in these forms. Notice that only the
second heading has number/letters vs the two levels from the standard style:

\numberedarea{Numbered Dungeon}
\label{sec:orgbf339af}
Areas in the Numbered Dungeon have sequential numbers. This is done using
the \emph{numberedmap} tag in your headers:

\numberedsubarea{Entry}
\label{sec:org47c910b}
The entry.
\numberedsubarea{Trap}
\label{sec:orgedd280f}
The trap.
\numberedsubarea{Fight}
\label{sec:org9ba81db}
The fight.
\numberedsubarea{Exit}
\label{sec:orgddd484a}
The exit.
\letteredarea{Lettered Dungeon}
\label{sec:orga700f1c}
Same as above but using the \emph{letteredmap} tag in the headers:

\letteredsubarea{Entry}
\label{sec:org982487d}
The entry.
\letteredsubarea{Trap}
\label{sec:org7f30ff7}
The trap.
\letteredsubarea{Fight}
\label{sec:orga9cd1f4}
The fight.
\letteredsubarea{Exit}
\label{sec:org57340a0}
The exit.
