example/example.org
** Text Boxes
   The module has three environments for setting text apart so that it is drawn to the reader's attention. =readaloud= is used for text that a game master would read aloud.

 #+BEGIN_readaloud
 As you approach this template you get a sense that the blood and tears of many generations went into its making. A warm feeling welcomes you as you type your first words.
 #+END_readaloud
*** As an Aside

    The other two environments are the =commentbox= and the =sidebar=. The =commentbox= is breakable and can safely be used inline in the text.

 #+name: This Is a Comment Box!
 #+begin_commentbox
 A =commentbox= is a box for minimal highlighting of text. It lacks the ornamentation of =sidebar=, but it can handle being broken over a column.

 You can use the =name= property to specify the title. If you do not, the first line of the content will be taken as the title.
 #+end_commentbox

 The =sidebar= is not breakable and is best used floated toward a page corner as it is below.

#+attr_dnd: :toc t
#+name: Behold, the Sidebar!
 #+BEGIN_sidebar
 The =sidebar= is used as a sidebar. It does not break over columns and is best used with a figure environment to float it to one corner of the page where the surrounding text can then flow around it.

 You can use the =toc= property to add the entry to the table of contents for both =commentbox= and =sidebar=.
 #+END_sidebar

*** Tables
 #+HEADER: Nice Table
 | Table head | Table head |
 | Some value | Some value |
 | Some value | Some value |
 | Some value | Some value |

 #+ATTR_DND: :format ornamental
 #+HEADER: Ornamental table
 | *Table head* | *Table head* |
 | Some value | Some value |
 | Some value | Some value |
 | Some value | Some value |

 #+attr_latex: :options {2}
     #+begin_multicols
 #+ATTR_DND: :format alt
 #+HEADER: Left table
 | *Head*       | *Head*       |
 | Value      | Value      |
 | Value      | Value      |
 | Value      | Value      |

 #+ATTR_DND: :format alt
 #+HEADER: Right table
 | *Head*       | *Head*       |
 | Value      | Value      |
 | Value      | Value      |
 | Value      | Value      |
     #+end_multicols


 #+attr_latex: :options {2}
     #+begin_multicols
 #+ATTR_DND: :format alt
 #+HEADER: Left~table~with~spanning
 | *Head*       | *Head*       |
 | Value      | Value      |
 | Value      | Value      |
 | Value      | Value      |

 #+ATTR_DND: :format alt
 #+HEADER: ~
 | *Head*  | *Head*  |
 | Value | Value |
 | Value | Value |
 | Value | Value |
     #+end_multicols


 #+attr_latex: :options {8cm}
 #+begin_minipage
 #+HEADER: Nice Table with footnote
 | *Table head* | *Table head*    |
 | Some value | Some value    |
 | Some value | Some value    |
 | Some value | Some value [fn:1] |

[fn:1] This is a footnote
 #+end_minipage

 #+ATTR_DND: :format long :align c p{0.5\\linewidth} p{0.20\\linewidth}
 #+HEADER: Long table
 | *Table head* | *Table head*                                                | *Table head* |
 | Some value | Some very long value that might expand more than one line | Some value   |
 | Some value | Some value                                                | Some value   |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                | Some value   |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                | Some value   |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |
 | Some value | Some value                                                |              |

 #+NAME: Monster Foo
 #+ATTR_MONSTER_INFO: :size medium :race metasyntactic variable :subrace goblinoid :alignment neutral evil
 #+ATTR_MONSTER_BASICS: :ac 9 (12 with \emph{mage armor}) :hp 3d8+3 :speed 30 :fly 30
 #+ATTR_MONSTER_STATS: :str 12 :dex 8 :con 13 :int 10 :wis 14 :cha 15
 #+ATTR_MONSTER_DETAILS: :langs Common, Goblin :senses darkvision 60ft., passive Perception 10 :cr 1
 #+begin_monster
 - Innate Spellcasting :: Foo's spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). It can innately cast the following spells, requiring no material components:
   - At will :: /misty step/
   - 3/day :: /fog cloud/, /rope trick/
   - 1/day :: /identify/
 - Spellcasting :: Foo is a 3rd-level spellcaster. Its spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). It has the following sorcerer spells prepared:
   - At will :: /blade ward/, /fire bolt/, /light/, /shocking grasp/
   - 1st level (4 slots) :: /burning hands/, /mage armor/
   - 2nd level (2 slots) :: /scorching ray/
 - Actions
   - Multiattack :: The foo makes two melee attacks.
   - Dagger :: /Melee or Ranged Weapon Attack:/ +3 to hit, reach 5 ft. or range 20/60ft., one target. /Hit:/ \DndDice{1d4 + 1} piercing damage.
   - Flame Tongue Longsword :: /Melee Weapon Attack:/ +3 to hit, reach 5 ft., one target. /Hit:/ \DndDice{1d4 + 1} slashing damage plus \DndDice{2d6} fire damage, or \DndDice{1d10 + 1} slashing damage plus \DndDice{2d6} fire damage if used with two
     hands.
   - Assassin's Light Crossbow :: /Ranged Weapon Attack:/ +0 to hit, range 80/320 ft., one target. /Hit:/ \DndDice{1d8} piercing damage, and the target must make a DC 15 Constitution saving throw, taking \DndDice{7d6} poison damage on a failed save, or half as much damage on a successful one.
 #+end_monster

* Customizations
