example/example.tex
\chapter{Text Boxes}
\label{sec:org6b565cd}
The module has three environments for setting text apart so that it is drawn to the reader's attention. \texttt{readaloud} is used for text that a game master would read aloud.

\begin{DndReadAloud}
As you approach this template you get a sense that the blood and tears of many generations went into its making. A warm feeling welcomes you as you type your first words.
\end{DndReadAloud}
\section{As an Aside}
\label{sec:orgbbfe1f4}

The other two environments are the \texttt{commentbox} and the \texttt{sidebar}. The \texttt{commentbox} is breakable and can safely be used inline in the text.

\begin{DndComment}{This Is a Comment Box!}\label{This Is a Comment Box!}
A \texttt{commentbox} is a box for minimal highlighting of text. It lacks the ornamentation of \texttt{sidebar}, but it can handle being broken over a column.

You can use the \texttt{name} property to specify the title. If you do not, the first line of the content will be taken as the title.
\end{DndComment}

The \texttt{sidebar} is not breakable and is best used floated toward a page corner as it is below.

\begin{DndSidebar}[float=!h]{Behold, the Sidebar!}\label{Behold, the Sidebar!}
\tocside{Behold, the Sidebar!}The \texttt{sidebar} is used as a sidebar. It does not break over columns and is best used with a figure environment to float it to one corner of the page where the surrounding text can then flow around it.

You can use the \texttt{toc} property to add the entry to the table of contents for both \texttt{commentbox} and \texttt{sidebar}.
\end{DndSidebar}

\section{Tables}
\label{sec:orgfd8bdf9}
\begin{DndTable}[header=Nice Table]{cX}
Table head & Table head\\[0pt]
Some value & Some value\\[0pt]
Some value & Some value\\[0pt]
Some value & Some value\\[0pt]
\end{DndTable}

\begin{ornamentedtabular}{cl}[title=Ornamental table]
\textbf{Table head} & \textbf{Table head}\\[0pt]
Some value & Some value\\[0pt]
Some value & Some value\\[0pt]
Some value & Some value\\[0pt]
\end{ornamentedtabular}

\begin{multicols}{2}
\begin{DndAltTable}[header=Left table]{cX}
\textbf{Head} & \textbf{Head}\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
\end{DndAltTable}

\begin{DndAltTable}[header=Right table]{cX}
\textbf{Head} & \textbf{Head}\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
\end{DndAltTable}
\end{multicols}


\begin{multicols}{2}
\begin{DndAltTable}[header=Left~table~with~spanning]{cX}
\textbf{Head} & \textbf{Head}\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
\end{DndAltTable}

\begin{DndAltTable}[header=~]{cX}
\textbf{Head} & \textbf{Head}\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
Value & Value\\[0pt]
\end{DndAltTable}
\end{multicols}


\begin{minipage}{8cm}
\begin{DndTable}[header=Nice Table with footnote]{cX}
\textbf{Table head} & \textbf{Table head}\\[0pt]
Some value & Some value\\[0pt]
Some value & Some value\\[0pt]
Some value & Some value \footnotemark\\[0pt]
\end{DndTable}

\footnotetext[1]{\label{orgc9a8f96}This is a footnote}
\end{minipage}

\begin{dndlongtable}[c p{0.5\linewidth} p{0.20\linewidth}]
\textbf{Table head} & \textbf{Table head} & \textbf{Table head}\\[0pt]
Some value & Some very long value that might expand more than one line & Some value\\[0pt]
Some value & Some value & Some value\\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & Some value\\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & Some value\\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
Some value & Some value & \\[0pt]
\end{dndlongtable}

\begin{DndMonster}{Monster Foo}
\DndMonsterType{Medium metasyntactic variable (goblinoid), neutral evil}
\DndMonsterBasics[%
armorclass = 9 (12 with \emph{mage armor}),
hitpoints = 3d8+3,
speed = {30 ft., fly 30 ft.},
]
\DndMonsterAbilityScores[%
CON = 13,
STR = 12,
DEX = 8,
INT = 10,
WIS = 14,
CHA = 15,
]
\DndMonsterDetails[%
senses = {darkvision 60ft., passive Perception 10},
languages = {Common, Goblin},
challenge = {1},
]
\DndMonsterAction{Innate Spellcasting}
Foo's spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\par
\DndMonsterAction{At will}
\emph{misty step}\par
\DndMonsterAction{3/day}
\emph{fog cloud}, \emph{rope trick}\par
\DndMonsterAction{1/day}
\emph{identify}\par
\DndMonsterAction{Spellcasting}
Foo is a 3rd-level spellcaster. Its spellcasting ability is Charisma (spell save DC 12, +4 to hit with spell attacks). It has the following sorcerer spells prepared:\par
\DndMonsterAction{At will}
\emph{blade ward}, \emph{fire bolt}, \emph{light}, \emph{shocking grasp}\par
\DndMonsterAction{1st level (4 slots)}
\emph{burning hands}, \emph{mage armor}\par
\DndMonsterAction{2nd level (2 slots)}
\emph{scorching ray}\par
\DndMonsterSection{Actions}
\DndMonsterAction{Multiattack}
The foo makes two melee attacks.\par
\DndMonsterAction{Dagger}
\emph{Melee or Ranged Weapon Attack:} +3 to hit, reach 5 ft. or range 20/60ft., one target. \emph{Hit:} \DndDice{1d4 + 1} piercing damage.\par
\DndMonsterAction{Flame Tongue Longsword}
\emph{Melee Weapon Attack:} +3 to hit, reach 5 ft., one target. \emph{Hit:} \DndDice{1d4 + 1} slashing damage plus \DndDice{2d6} fire damage, or \DndDice{1d10 + 1} slashing damage plus \DndDice{2d6} fire damage if used with two
hands.\par
\DndMonsterAction{Assassin's Light Crossbow}
\emph{Ranged Weapon Attack:} +0 to hit, range 80/320 ft., one target. \emph{Hit:} \DndDice{1d8} piercing damage, and the target must make a DC 15 Constitution saving throw, taking \DndDice{7d6} poison damage on a failed save, or half as much damage on a successful one.\par
\end{DndMonster}

\part{Customizations}
\label{sec:org360651f}
