example/example.org
** Colors

 This package provides several global color variables to style =commentbox=, =readaloud=, =sidebar=, and =dndtable= environments.

 #+attr_dnd: :align lX
 | *Color*           | *Description*                                |
 | =commentboxcolor= | Controls =commentbox= background.            |
 | =paperboxcolor=   | Controls =paperbox= background.              |
 | =quoteboxcolor=   | Controls =quotebox= background.              |
 | =tablecolor=      | Controls background of even =dndtable= rows. |

 See Table [[tab:colors]] for a list of accent colors that match the core books.

 #+name: tab:colors
 #+caption: Colors supported by this package
 #+attr_dnd: :align XX
 | *Color*                                               | *Description*                               |
 | \rowcolor{PhbLightGreen} =PhbLightGreen=              | Light green used in PHB Part 1            |
 | \rowcolor{PhbLightCyan} =PhbLightCyan=                | Light cyan used in PHB Part 2             |
 | \rowcolor{PhbMauve} =PhbMauve=                        | Pale purple used in PHB Part 3            |
 | \rowcolor{PhbTan} =PhbTan=                            | Light brown used in PHB appendix          |
 | \rowcolor{DmgLavender} =DmgLavender=                  | Pale purple used in DMG Part 1            |
 | \rowcolor{DmgCoral} =DmgCoral=                        | Orange-pink used in DMG Part 2            |
 | \rowcolor{DmgSlateGrey} =DmgSlateGray= (=DmgSlateGrey=) | Blue-gray used in PHB Part 3              |
 | \rowcolor{DmgLilac} =DmgLilac=                        | Purple-gray used in DMG appendix          |
 | \rowcolor{BrGreen} =BrGreen=                          | Light-gray used for tables in Basic Rules |

 - Use =\DndSetThemeColor[<color>]= to set =themecolor=, =commentcolor=, =paperboxcolor=, and =tablecolor= to a specific color.
 - Calling =\DndSetThemeColor= without an argument sets those colors to the current =themecolor=.
 - =commentbox=, =dndtable=, =paperbox=, and =quoteboxcolor= also accept an optional color argument to set the color for a single instance.

**** Examples
***** Using =themecolor=

 \DndSetThemeColor[PhbMauve]

 #+NAME: This comment is in Mauve
 #+begin_commentbox
 \lipsum[1][1-2]
 #+end_commentbox

 #+NAME: This sidebar is in Mauve
 #+begin_sidebar
 \lipsum[1][3-4]
 #+end_sidebar

 \DndSetThemeColor[PhbLightCyan]

 #+HEADER: Example
 #+ATTR_DND: :align cX
 | *d8* | *Item*                  |
 |    1 | Small wooden button     |
 |    2 | Red feather             |
 |    3 | Human tooth             |
 |    4 | Vial of green liquid    |
 |    6 | Tasty biscuit           |
 |    7 | Broken axe handle       |
 |    8 | Tarnished silver locket |

***** Using element color arguments

 #+ATTR_DND: :align cX :color DmgCoral
 | *d8* | *Item*                    |
 |  1 | Small wooden button     |
 |  2 | Red feather             |
 |  3 | Human tooth             |
 |  4 | Vial of green liquid    |
 |  6 | Tasty biscuit           |
 |  7 | Broken axe handle       |
 |  8 | Tarnished silver locket |



 \appendix
* Appendices
** One Last Thing
  \DndDropCapLine{U}sing the =\appendix= command causes all subsequent chapters to be formatted as appendices. Neat!
