example/example.tex
\chapter{Colors}
\label{sec:org5ffd89b}

This package provides several global color variables to style \texttt{commentbox}, \texttt{readaloud}, \texttt{sidebar}, and \texttt{dndtable} environments.

\begin{DndTable}{lX}
\textbf{Color} & \textbf{Description}\\[0pt]
\texttt{commentboxcolor} & Controls \texttt{commentbox} background.\\[0pt]
\texttt{paperboxcolor} & Controls \texttt{paperbox} background.\\[0pt]
\texttt{quoteboxcolor} & Controls \texttt{quotebox} background.\\[0pt]
\texttt{tablecolor} & Controls background of even \texttt{dndtable} rows.\\[0pt]
\end{DndTable}

See Table \ref{tab:colors} for a list of accent colors that match the core books.

\begin{table}[htbp]
\begin{DndTable}{XX}
\textbf{Color} & \textbf{Description}\\[0pt]
\rowcolor{PhbLightGreen} \texttt{PhbLightGreen} & Light green used in PHB Part 1\\[0pt]
\rowcolor{PhbLightCyan} \texttt{PhbLightCyan} & Light cyan used in PHB Part 2\\[0pt]
\rowcolor{PhbMauve} \texttt{PhbMauve} & Pale purple used in PHB Part 3\\[0pt]
\rowcolor{PhbTan} \texttt{PhbTan} & Light brown used in PHB appendix\\[0pt]
\rowcolor{DmgLavender} \texttt{DmgLavender} & Pale purple used in DMG Part 1\\[0pt]
\rowcolor{DmgCoral} \texttt{DmgCoral} & Orange-pink used in DMG Part 2\\[0pt]
\rowcolor{DmgSlateGrey} \texttt{DmgSlateGray} (\texttt{DmgSlateGrey}) & Blue-gray used in PHB Part 3\\[0pt]
\rowcolor{DmgLilac} \texttt{DmgLilac} & Purple-gray used in DMG appendix\\[0pt]
\rowcolor{BrGreen} \texttt{BrGreen} & Light-gray used for tables in Basic Rules\\[0pt]
\end{DndTable}
\caption{\label{tab:colors}Colors supported by this package}

\end{table}

\begin{itemize}
\item Use \texttt{\textbackslash{}DndSetThemeColor[<color>]} to set \texttt{themecolor}, \texttt{commentcolor}, \texttt{paperboxcolor}, and \texttt{tablecolor} to a specific color.
\item Calling \texttt{\textbackslash{}DndSetThemeColor} without an argument sets those colors to the current \texttt{themecolor}.
\item \texttt{commentbox}, \texttt{dndtable}, \texttt{paperbox}, and \texttt{quoteboxcolor} also accept an optional color argument to set the color for a single instance.
\end{itemize}

\subsection{Examples}
\label{sec:org6beaae5}
\subsubsection{Using \texttt{themecolor}}
\label{sec:org455498c}

\DndSetThemeColor[PhbMauve]

\begin{DndComment}{This comment is in Mauve}\label{This comment is in Mauve}
\lipsum[1][1-2]
\end{DndComment}

\begin{DndSidebar}[float=!h]{This sidebar is in Mauve}\label{This sidebar is in Mauve}
\lipsum[1][3-4]
\end{DndSidebar}

\DndSetThemeColor[PhbLightCyan]

\begin{DndTable}[header=Example]{cX}
\textbf{d8} & \textbf{Item}\\[0pt]
1 & Small wooden button\\[0pt]
2 & Red feather\\[0pt]
3 & Human tooth\\[0pt]
4 & Vial of green liquid\\[0pt]
6 & Tasty biscuit\\[0pt]
7 & Broken axe handle\\[0pt]
8 & Tarnished silver locket\\[0pt]
\end{DndTable}

\subsubsection{Using element color arguments}
\label{sec:org83acaf4}

\begin{DndTable}[color=DmgCoral]{cX}
\textbf{d8} & \textbf{Item}\\[0pt]
1 & Small wooden button\\[0pt]
2 & Red feather\\[0pt]
3 & Human tooth\\[0pt]
4 & Vial of green liquid\\[0pt]
6 & Tasty biscuit\\[0pt]
7 & Broken axe handle\\[0pt]
8 & Tarnished silver locket\\[0pt]
\end{DndTable}



\appendix
\part{Appendices}
\label{sec:org2c95788}
\chapter{One Last Thing}
\label{sec:org9ab587b}
\DndDropCapLine{U}sing the \texttt{\textbackslash{}appendix} command causes all subsequent chapters to be formatted as appendices. Neat!
\end{document}
